dependencies/multiRegionFoam/tutorials/twoPhaseStratifiedFlow/meshA/constant/surfaceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object freeSurfaceProperties;
}

surfaceType interface;

normalMotionDir yes;
motionDir (0 0 0);

cleanInterface yes;
muFluidA muFluidA     [ 1 -1 -1 0 0 0 0 ]     0.0005 ; 	//fluid2

muFluidB muFluidB     [ 1 -1 -1 0 0 0 0 ]     1.85e-05 ; 	//fluid1

rhoFluidA rhoFluidA     [ 1 -3 0 0 0 0 0 ]     1.0 ;

rhoFluidB rhoFluidB     [ 1 -3 0 0 0 0 0 ]     1.0 ; 	//1.3

cleanSurfaceTension cleanSurfaceTension     [ 1 0 -2 0 0 0 0 ]     0.0727 ;

g g     [ 0 1 -2 0 0 0 0 ]     (0 9.81 0) ;

fixedSurfacePatches
  (
  );

pointNormalsCorrectionPatches
  (
  );

nSurfaceCorrectors 1;

relax 0.5;

interfaceDeformationLimit interfaceDeformationLimit     [ 0 0 0 0 0 0 0 ]     1e-06 ;

surfactantProperties
{
  bulkConc bulkConc       [ 0 -3 0 0 1 0 0 ]       0.01 ;
  saturatedConc saturatedSurfConc       [ 0 -2 0 0 1 0 0 ]       5e-06 ;
  adsorptionCoeff adsorptionCoeff       [ 0 3 -1 0 -1 0 0 ]       40.0 ;
  desorptionCoeff desorptionCoeff       [ 0 -3 0 0 1 0 0 ]       0.0893 ;
  bulkDiffusion bulkDiffusion       [ 0 2 -1 0 0 0 0 ]       1e-09 ; 	//diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-9;
  diffusion diffusion       [ 0 2 -1 0 0 0 0 ]       1e-07 ;
  temperature temperature       [ 0 0 0 1 0 0 0 ]       293.0 ;
} 	// ************************************************************************* //

