dependencies/multiRegionFoam/tutorials/twoPhaseStratifiedFlow/meshA/0/curvatureNew
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      curvatureNew;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
3997.129683556253
3997.03234744285
3996.924911858154
3996.805778645507
3996.674438519606
3996.527183175014
3996.36339174865
3996.179329844672
...
)
;
    }
    space
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWedge
    {
        type            wedge;
    }
    upperWedge
    {
        type            wedge;
    }
    centerline
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
